GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p16F17574.inc
;----- APMPERS1U Bits -----------------------------------------------------
OPA3             EQU  H'0000'
OPA4             EQU  H'0001'
VREFLPDAC        EQU  H'0006'
VREFLP           EQU  H'0007'


;----- APMPERS2 Bits -----------------------------------------------------
SOSC             EQU  H'0000'
POSC             EQU  H'0001'
BG               EQU  H'0002'
FVR1             EQU  H'0003'
FVR2             EQU  H'0004'
ADCD             EQU  H'0005'
ADCA             EQU  H'0006'
TEMP             EQU  H'0007'


;----- APMPERS2H Bits -----------------------------------------------------
OPA1             EQU  H'0000'
OPA2             EQU  H'0001'
DAC1             EQU  H'0002'
DAC2             EQU  H'0003'
CMP1             EQU  H'0005'
CMPLP1           EQU  H'0006'
ZCD              EQU  H'0007'


;----- APMPERS2U Bits -----------------------------------------------------
OPA3             EQU  H'0000'
OPA4             EQU  H'0001'
VREFLPDAC        EQU  H'0006'
VREFLP           EQU  H'0007'


;----- APMPERE1 Bits -----------------------------------------------------
SOSC             EQU  H'0000'
POSC             EQU  H'0001'
BG               EQU  H'0002'
FVR1             EQU  H'0003'
FVR2             EQU  H'0004'
ADCD             EQU  H'0005'
ADCA             EQU  H'0006'
TEMP             EQU  H'0007'
APMPERE1_2       EQU  H'0002'
APMPERE1_3       EQU  H'0003'
APMPERE1_4       EQU  H'0004'
APMPERE1_5       EQU  H'0005'
APMPERE1_6       EQU  H'0006'
APMPERE1_7       EQU  H'0007'


;----- APMPERE1H Bits -----------------------------------------------------
OPA1             EQU  H'0000'
OPA2             EQU  H'0001'
DAC1             EQU  H'0002'
DAC2             EQU  H'0003'
CMP1             EQU  H'0005'
CMPLP1           EQU  H'0006'
ZCD              EQU  H'0007'
APMPERE1_8       EQU  H'0000'
APMPERE1_9       EQU  H'0001'
APMPERE1_10      EQU  H'0002'
APMPERE1_11      EQU  H'0003'
APMPERE1_13      EQU  H'0005'
APMPERE1_14      EQU  H'0006'
APMPERE1_15      EQU  H'0007'


;----- APMPERE1U Bits -----------------------------------------------------
OPA3             EQU  H'0000'
OPA4             EQU  H'0001'
VREFLPDAC        EQU  H'0006'
VREFLP           EQU  H'0007'


;----- APMPERE2 Bits -----------------------------------------------------
SOSC             EQU  H'0000'
POSC             EQU  H'0001'
BG               EQU  H'0002'
FVR1             EQU  H'0003'
FVR2             EQU  H'0004'
ADCD             EQU  H'0005'
ADCA             EQU  H'0006'
TEMP             EQU  H'0007'
APMPERE2_2       EQU  H'0002'
APMPERE2_3       EQU  H'0003'
APMPERE2_4       EQU  H'0004'
APMPERE2_5       EQU  H'0005'
APMPERE2_6       EQU  H'0006'
APMPERE2_7       EQU  H'0007'


;----- APMPERE2H Bits -----------------------------------------------------
OPA1             EQU  H'0000'
OPA2             EQU  H'0001'
DAC1             EQU  H'0002'
DAC2             EQU  H'0003'
CMP1             EQU  H'0005'
CMPLP1           EQU  H'0006'
ZCD              EQU  H'0007'
APMPERE2_8       EQU  H'0000'
APMPERE2_9       EQU  H'0001'
APMPERE2_10      EQU  H'0002'
APMPERE2_11      EQU  H'0003'
APMPERE2_13      EQU  H'0005'
APMPERE2_14      EQU  H'0006'
APMPERE2_15      EQU  H'0007'


;----- APMPERE2U Bits -----------------------------------------------------
OPA3             EQU  H'0000'
OPA4             EQU  H'0001'
VREFLPDAC        EQU  H'0006'
VREFLP           EQU  H'0007'


;----- APMCLK Bits -----------------------------------------------------
CLK0             EQU  H'0000'
CLK1             EQU  H'0001'
CLK2             EQU  H'0002'
CLK3             EQU  H'0003'
CLK4             EQU  H'0004'
CLK5             EQU  H'0005'
CLK6             EQU  H'0006'
CLK7             EQU  H'0007'
APMCLK0          EQU  H'0000'
APMCLK1          EQU  H'0001'
APMCLK2          EQU  H'0002'
APMCLK3          EQU  H'0003'
APMCLK4          EQU  H'0004'
APMCLK5          EQU  H'0005'
APMCLK6          EQU  H'0006'
APMCLK7          EQU  H'0007'


;----- APMSTATUS Bits -----------------------------------------------------
SOSC             EQU  H'0000'
POSC             EQU  H'0001'
BG               EQU  H'0002'
FVR1             EQU  H'0003'
FVR2             EQU  H'0004'
ADCD             EQU  H'0005'
ADCA             EQU  H'0006'
TEMP             EQU  H'0007'
APMSTATUS_2      EQU  H'0002'
APMSTATUS_3      EQU  H'0003'
APMSTATUS_4      EQU  H'0004'
APMSTATUS_5      EQU  H'0005'
APMSTATUS_6      EQU  H'0006'
APMSTATUS_7      EQU  H'0007'


;----- APMSTATUSH Bits -----------------------------------------------------
OPA1             EQU  H'0000'
OPA2             EQU  H'0001'
DAC1             EQU  H'0002'
DAC2             EQU  H'0003'
CMP1             EQU  H'0005'
CMPLP1           EQU  H'0006'
ZCD              EQU  H'0007'
APMSTATUS_8      EQU  H'0000'
APMSTATUS_9      EQU  H'0001'
APMSTATUS_10     EQU  H'0002'
APMSTATUS_11     EQU  H'0003'
APMSTATUS_13     EQU  H'0005'
APMSTATUS_14     EQU  H'0006'
APMSTATUS_15     EQU  H'0007'


;----- APMSTATUSU Bits -----------------------------------------------------
OPA3             EQU  H'0000'
OPA4             EQU  H'0001'
VREFLPDAC        EQU  H'0006'
VREFLP           EQU  H'0007'


;----- STATUS_SHAD Bits -----------------------------------------------------
STATUS_SHAD0     EQU  H'0000'
STATUS_SHAD1     EQU  H'0001'
STATUS_SHAD2     EQU  H'0002'


;----- STKPTR Bits -----------------------------------------------------
STKPTR0          EQU  H'0000'
STKPTR1          EQU  H'0001'
STKPTR2          EQU  H'0002'
STKPTR3          EQU  H'0003'
STKPTR4          EQU  H'0004'


;----- TOSL Bits -----------------------------------------------------
TOSL0            EQU  H'0000'
TOSL1            EQU  H'0001'
TOSL2            EQU  H'0002'
TOSL3            EQU  H'0003'
TOSL4            EQU  H'0004'

;==========================================================================
;
;       RAM Definitions
;
;==========================================================================

       __MAXRAM  H'0FFF'
       __BADRAM  H'0011'
       __BADRAM  H'0017'
       __BADRAM  H'001E'-H'0020'
       __BADRAM  H'0094'-H'0095'
       __BADRAM  H'009E'-H'009F'
       __BADRAM  H'0112'-H'011F'
       __BADRAM  H'0194'-H'019B'
       __BADRAM  H'0210'-H'021E'
       __BADRAM  H'0295'
       __BADRAM  H'0298'-H'029F'
       __BADRAM  H'0318'-H'031F'
       __BADRAM  H'039E'-H'039F'
       __BADRAM  H'0414'-H'041E'
       __BADRAM  H'049B'-H'049D'
       __BADRAM  H'051B'-H'051F'
       __BADRAM  H'0594'-H'059F'
       __BADRAM  H'0615'-H'061F'
       __BADRAM  H'0698'-H'069F'
       __BADRAM  H'0713'-H'0715'
       __BADRAM  H'071E'-H'0720'
       __BADRAM  H'0793'-H'0795'
       __BADRAM  H'079E'-H'07A0'
       __BADRAM  H'0814'-H'081E'
       __BADRAM  H'088F'
       __BADRAM  H'0893'-H'08A0'
       __BADRAM  H'0918'-H'091B'
       __BADRAM  H'098C'-H'0990'
       __BADRAM  H'0A0C'-H'0A10'
       __BADRAM  H'0B8C'-H'0B9F'
       __BADRAM  H'0C0C'-H'0C1F'
       __BADRAM  H'0C8C'-H'0C9F'
       __BADRAM  H'0E0C'-H'0E1F'
       __BADRAM  H'0E8C'-H'0E9F'
       __BADRAM  H'0E0C'-H'0E1F'
       __BADRAM  H'0E8C'-H'0E9F'
       __BADRAM  H'0F0C'-H'0F1F'
       __BADRAM  H'0F8C'-H'0F9F'
       __BADRAM  H'100C'-H'101F'
       __BADRAM  H'108C'-H'109F'
       __BADRAM  H'110C'-H'111F'
       __BADRAM  H'118C'-H'119F'
       __BADRAM  H'120C'-H'121F'
       __BADRAM  H'128C'-H'129F'
       __BADRAM  H'130C'-H'131F'
       __BADRAM  H'138C'-H'139F'
       __BADRAM  H'140C'-H'141F'
       __BADRAM  H'148C'-H'149F'
       __BADRAM  H'150C'-H'151F'
       __BADRAM  H'158C'-H'159F'
       __BADRAM  H'160C'-H'161F'
       __BADRAM  H'168C'-H'169F'
       __BADRAM  H'170C'-H'171F'
       __BADRAM  H'178C'-H'179F'
       __BADRAM  H'180C'-H'181F'
       __BADRAM  H'188C'-H'189F'
       __BADRAM  H'190C'-H'191F'
       __BADRAM  H'198C'-H'199F'
       __BADRAM  H'1A0C'-H'1A1F'
       __BADRAM  H'1A8C'-H'1A9F'
       __BADRAM  H'1B0C'-H'1B1F'
       __BADRAM  H'1B8C'-H'1B9F'
       __BADRAM  H'1C0C'-H'1C1F'
       __BADRAM  H'1C94'
       __BADRAM  H'1C97'
       __BADRAM  H'1E33'-H'1E70'
       __BADRAM  H'1E13'-H'1E18'
       __BADRAM  H'1E1C'-H'1E1D'
       __BADRAM  H'1E20'-H'1E23'
       __BADRAM  H'1E28'-H'1E38'
       __BADRAM  H'1E3A'-H'1E3C'
       __BADRAM  H'1E45'-H'1E46'
       __BADRAM  H'1E4E'-H'1E50'
       __BADRAM  H'1E51'-H'1E56'
       __BADRAM  H'1E5B'-H'1E6F'
       __BADRAM  H'1E94'-H'1E95'
       __BADRAM  H'1E9E'-H'1E9F'
       __BADRAM  H'1EA8'-H'1EA9'
       __BADRAM  H'1EAF'-H'1EB3'
       __BADRAM  H'1EBC'-H'1ECC'
       __BADRAM  H'1EE0'-H'1EF2'
       __BADRAM  H'1EE5'-H'1EEA'
       __BADRAM  H'1EEE'
       __BADRAM  H'1F0F'-H'1F21'
       __BADRAM  H'1F2F'-H'1F4C'
       __BADRAM  H'1F8C'-H'1FE3'
       __BADRAM  H'1FEC'


